ib2b-documentation/assets/services/managespinventory/updateInventory/Normal - Inventory Updated (NWAS)/00_updateInventoryRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
	@operation updateInventory
	@action requestInventoryAmend
	@sender EPS
	@receiver FLS
	@scenario Amend inventory (NWAS)
	@name Normal - Amend inventory
	@description This is a sample request message for the scenario: Inventory amended for NWAS
	@version V1.0
-->
<soapenv:Envelope 
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:dns="http://www.nbnco.com.au/cim/manageSPInventory/v5" 
	xmlns:mhe="http://www.nbnco.com.au/cim/common/messageHeader/v3">
	<soapenv:Header>
		<mhe:MessageHeader>
			<activityName>updateInventory</activityName>
			<msgName>ManageSPInventoryupdateInventoryRequest</msgName>
			<businessServiceName>ManageSPInventory</businessServiceName>
			<businessServiceVersion>V1.0</businessServiceVersion>
			<msgType>Request</msgType>
			<accessSeekerID>SDP000000000001</accessSeekerID>
			<correlationId>4eef4405-606e-46db-8c5c-af78e2874077</correlationId>
			<security>Placeholder Security</security>
			<priority>6</priority>
			<communicationPattern>RequestReply</communicationPattern>
			<timestamp>2014-08-18T12:00:01Z</timestamp>
			<businessChannel>B2B</businessChannel>
			<HeaderCharacteristicValue>
				<value>FALSE</value>
				<Characteristic>
					<name>Mocked</name>
				</Characteristic>
			</HeaderCharacteristicValue>
			<!-- The B2B gateway may send multiple (undefined) characteristics that 
				should be echoed back in the response from Fulfilment -->
			<HeaderCharacteristicValue>
				<value>EPS-NBNCO-PROD-0004</value>
				<Characteristic>
					<name>cpaId</name>
					<type>String</type>
				</Characteristic>
			</HeaderCharacteristicValue>
			<HeaderCharacteristicValue>
				<value>SDP000000000001</value>
				<Characteristic>
					<name>fromPartner</name>
					<type>String</type>
				</Characteristic>
			</HeaderCharacteristicValue>
		</mhe:MessageHeader>
	</soapenv:Header>


	<soapenv:Body>
		<dns:ManageSPInventoryRequest>
			<SPInventory>
				<ID>ORD000000000001</ID>
				<interactionDate>2014-08-18T12:00:00.000Z</interactionDate>

				<SPInventoryComprisedOf>
					<!-- NSAS or NWAS -->
					<ItemInvolvesProduct>
						<type>NWAS</type>
					</ItemInvolvesProduct>


					<ReferencesSPInventoryItem>
						<action>ADD</action>
						<!-- NTD -->
						<ItemInvolvesResource>
							<ID>NTD000000000001</ID>

							<DescribedBy>
								<value>LOC000000000001</value>
								<Characteristic>
									<ID>locationId</ID>
								</Characteristic>
							</DescribedBy>

							<DescribedBy>
								<value>PENDING</value>
								<Characteristic>
									<ID>ntdState</ID>
								</Characteristic>
							</DescribedBy>

							<DescribedBy>
								<value>In-door Unit Serial Number</value>
								<Characteristic>
									<ID>iduSerialNumber</ID>
								</Characteristic>
							</DescribedBy>

							<DescribedBy>
								<value>Out-door Unit Serial Number</value>
								<Characteristic>
									<ID>oduSerialNumber</ID>
								</Characteristic>
							</DescribedBy>

							<DescribedBy>
								<value>1.1.1.1</value>
								<Characteristic>
									<ID>ntdIpAddress</ID>
								</Characteristic>
							</DescribedBy>

							<!-- Vendor Model Number -->
							<DescribedBy>
								<value>301547</value>
								<Characteristic>
									<ID>ntdModel</ID>
								</Characteristic>
							</DescribedBy>

							<DescribedBy>
								<value>V1</value>
								<Characteristic>
									<ID>ntdVersion</ID>
								</Characteristic>
							</DescribedBy>

							<DescribedBy>
								<value>16dBi</value>
								<Characteristic>
									<ID>ntdAntenna</ID>
								</Characteristic>
							</DescribedBy>

							<DescribedBy>
								<value>23dBm</value>
								<Characteristic>
									<ID>ntdPower</ID>
								</Characteristic>
							</DescribedBy>

							<!-- International Mobile Station Equipment Identity. Uniquely identifies 
								Wireless NTD Outdoor Unit. 15 digit numeric. -->
							<DescribedBy>
								<value>358944041231611</value>
								<Characteristic>
									<ID>imei</ID>
								</Characteristic>
							</DescribedBy>

							<!-- International Mobile Subscriber Identity. Uniquely identifies 
								the SIM card on the Wireless NTD. 15 digit numeric. -->
							<DescribedBy>
								<value>505626260023732</value>
								<Characteristic>
									<ID>imsi</ID>
								</Characteristic>
							</DescribedBy>

							<!-- Wireless Topology Cell Id that was actually used to configure 
								the NTD. Cell to be in ECGI format. -->
							<DescribedBy>
								<value>50562179402499</value>
								<Characteristic>
									<ID>cellId</ID>
								</Characteristic>
							</DescribedBy>

							<!-- Physical Cell Identifier of the Wireless Topology Cell actually 
								used to configure the NTD. The pci is not globally unique. Integer between 
								0 and 503. -->
							<DescribedBy>
								<value>503</value>
								<Characteristic>
									<ID>pci</ID>
								</Characteristic>
							</DescribedBy>

							<type>NTD</type>
						</ItemInvolvesResource>


						<!-- UNI-D -->
						<ReferencesSPInventoryItem>
							<action>ADD</action>
							<ItemInvolvesResource>
								<ID>UNI000000000001</ID>
								<DescribedBy>
									<value>1</value>
									<Characteristic>
										<ID>portNumber</ID>
									</Characteristic>
								</DescribedBy>

								<!-- DSCP-Mapped, Default-Mapped, Priority-Tagged, Tagged -->
								<DescribedBy>
									<value>DSCP-Mapped</value>
									<Characteristic>
										<ID>vlanMode</ID>
									</Characteristic>
								</DescribedBy>

								<!-- 100Mbps, Auto Duplex (Half/Full) OR Auto Negotiation -->
								<DescribedBy>
									<value>Auto Negotiation</value>
									<Characteristic>
										<ID>speedAndDuplex</ID>
									</Characteristic>
								</DescribedBy>

								<type>UNID</type>
							</ItemInvolvesResource>

							<!-- AVC-D -->
							<ReferencesSPInventoryItem>
								<action>ADD</action>
								<ItemInvolvesService>
									<ID>AVC000000000001</ID>
									<DescribedBy>
										<value>CVC000000000001</value>
										<Characteristic>
											<ID>cvcId</ID>
										</Characteristic>
									</DescribedBy>

									<DescribedBy>
										<value>1</value>
										<Characteristic>
											<ID>uniVlan</ID>
										</Characteristic>
									</DescribedBy>
									
									<DescribedBy>
										<value>Bandwidth 1 (FLS or Ericsson to provide sample value)
										</value>
										<Characteristic>
											<ID>bandwidthProfile</ID>
										</Characteristic>
									</DescribedBy>
									
									<DescribedBy>
										<value>I-NNI S-TAG</value>
										<Characteristic>
											<ID>sVlanid</ID>
										</Characteristic>
									</DescribedBy>

									<type>AVCD</type>
								</ItemInvolvesService>
							</ReferencesSPInventoryItem>
						</ReferencesSPInventoryItem>


					</ReferencesSPInventoryItem>
				</SPInventoryComprisedOf>
			</SPInventory>
		</dns:ManageSPInventoryRequest>
	</soapenv:Body>
</soapenv:Envelope>